Revit 2026 API

# ExporterIFCUtilsGetGlobal3DDirectionHandles Method

---

Obtains the handles representing the cardinal directions in 3D.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static IList<IFCAnyHandle> GetGlobal3DDirectionHandles(
	bool positive
)
```
```vb
Public Shared Function GetGlobal3DDirectionHandles (
	positive As Boolean
) As IList(Of IFCAnyHandle)
```
```cpp
public:
static IList<IFCAnyHandle^>^ GetGlobal3DDirectionHandles(
	bool positive
)
```
```fsharp
static member GetGlobal3DDirectionHandles :
        positive : bool -> IList<IFCAnyHandle>
```

#### Parameters

positive Boolean
     True if the handles returned should be in the positive direction, false if the handles should be in the negative direction.

#### Return Value

IListIFCAnyHandle The collection of handles.

#### Reference

ExporterIFCUtils Class

Autodesk.Revit.DB.IFC Namespace